austinglaser/ddl/labs/lab2/asm_xample11/Debug/cr_startup_lpc11.asm
 227:../src/cr_startup_lpc11.c **** // This is the code that gets called when the processor receives a NMI.  This
 228:../src/cr_startup_lpc11.c **** // simply enters an infinite loop, preserving the system state for examination
 229:../src/cr_startup_lpc11.c **** // by a debugger.
 230:../src/cr_startup_lpc11.c **** //
 231:../src/cr_startup_lpc11.c **** //*****************************************************************************
 232:../src/cr_startup_lpc11.c **** void NMI_Handler(void)
 233:../src/cr_startup_lpc11.c **** {
 170              		.loc 1 233 0
 171              		.cfi_startproc
 172 0000 80B5     		push	{r7, lr}
 173              	.LCFI3:
 174              		.cfi_def_cfa_offset 8
 175              		.cfi_offset 7, -8
 176              		.cfi_offset 14, -4
 177 0002 00AF     		add	r7, sp, #0
 178              	.LCFI4:
 179              		.cfi_def_cfa_register 7
 180              	.L11:
 234:../src/cr_startup_lpc11.c ****     //
 235:../src/cr_startup_lpc11.c ****     // Enter an infinite loop.
 236:../src/cr_startup_lpc11.c ****     //
 237:../src/cr_startup_lpc11.c ****     while(1)
 238:../src/cr_startup_lpc11.c ****     {
 239:../src/cr_startup_lpc11.c ****     }
 181              		.loc 1 239 0 discriminator 1
 182 0004 FEE7     		b	.L11
 183              		.cfi_endproc
 184              	.LFE1:
 186 0006 C046     		.section	.text.HardFault_Handler,"ax",%progbits
 187              		.align	2
 188              		.weak	HardFault_Handler
 189              		.code	16
 190              		.thumb_func
 192              	HardFault_Handler:
 193              	.LFB2:
 240:../src/cr_startup_lpc11.c **** }
 241:../src/cr_startup_lpc11.c **** 
 242:../src/cr_startup_lpc11.c **** //*****************************************************************************
 243:../src/cr_startup_lpc11.c **** //
 244:../src/cr_startup_lpc11.c **** // This is the code that gets called when the processor receives a fault
 245:../src/cr_startup_lpc11.c **** // interrupt.  This simply enters an infinite loop, preserving the system state
 246:../src/cr_startup_lpc11.c **** // for examination by a debugger.
 247:../src/cr_startup_lpc11.c **** //
 248:../src/cr_startup_lpc11.c **** //*****************************************************************************
 249:../src/cr_startup_lpc11.c **** void HardFault_Handler(void)
 250:../src/cr_startup_lpc11.c **** {
 194              		.loc 1 250 0
 195              		.cfi_startproc
 196 0000 80B5     		push	{r7, lr}
 197              	.LCFI5:
 198              		.cfi_def_cfa_offset 8
 199              		.cfi_offset 7, -8
 200              		.cfi_offset 14, -4
 201 0002 00AF     		add	r7, sp, #0
 202              	.LCFI6:
 203              		.cfi_def_cfa_register 7
 204              	.L13:
 251:../src/cr_startup_lpc11.c ****     //
 252:../src/cr_startup_lpc11.c ****     // Enter an infinite loop.
 253:../src/cr_startup_lpc11.c ****     //
 254:../src/cr_startup_lpc11.c ****     while(1)
 255:../src/cr_startup_lpc11.c ****     {
 256:../src/cr_startup_lpc11.c ****     }
 205              		.loc 1 256 0 discriminator 1
 206 0004 FEE7     		b	.L13
 207              		.cfi_endproc
 208              	.LFE2:
 210 0006 C046     		.section	.text.SVCall_Handler,"ax",%progbits
 211              		.align	2
 212              		.weak	SVCall_Handler
 213              		.code	16
 214              		.thumb_func
 216              	SVCall_Handler:
 217              	.LFB3:
 257:../src/cr_startup_lpc11.c **** }
 258:../src/cr_startup_lpc11.c **** 
 259:../src/cr_startup_lpc11.c **** void SVCall_Handler(void)
 260:../src/cr_startup_lpc11.c **** {
 218              		.loc 1 260 0
 219              		.cfi_startproc
 220 0000 80B5     		push	{r7, lr}
 221              	.LCFI7:
 222              		.cfi_def_cfa_offset 8
 223              		.cfi_offset 7, -8
 224              		.cfi_offset 14, -4
 225 0002 00AF     		add	r7, sp, #0
 226              	.LCFI8:
 227              		.cfi_def_cfa_register 7
 228              	.L15:
 261:../src/cr_startup_lpc11.c ****     while(1)
 262:../src/cr_startup_lpc11.c ****     {
 263:../src/cr_startup_lpc11.c ****     }
 229              		.loc 1 263 0 discriminator 1
 230 0004 FEE7     		b	.L15
 231              		.cfi_endproc
 232              	.LFE3:
 234 0006 C046     		.section	.text.PendSV_Handler,"ax",%progbits
 235              		.align	2
 236              		.weak	PendSV_Handler
 237              		.code	16
 238              		.thumb_func
 240              	PendSV_Handler:
 241              	.LFB4:
 264:../src/cr_startup_lpc11.c **** }
 265:../src/cr_startup_lpc11.c **** 
 266:../src/cr_startup_lpc11.c **** void PendSV_Handler(void)
 267:../src/cr_startup_lpc11.c **** {
 242              		.loc 1 267 0
 243              		.cfi_startproc
 244 0000 80B5     		push	{r7, lr}
 245              	.LCFI9:
 246              		.cfi_def_cfa_offset 8
 247              		.cfi_offset 7, -8
 248              		.cfi_offset 14, -4
 249 0002 00AF     		add	r7, sp, #0
 250              	.LCFI10:
 251              		.cfi_def_cfa_register 7
 252              	.L17:
 268:../src/cr_startup_lpc11.c ****     while(1)
 269:../src/cr_startup_lpc11.c ****     {
 270:../src/cr_startup_lpc11.c ****     }
 253              		.loc 1 270 0 discriminator 1
 254 0004 FEE7     		b	.L17
 255              		.cfi_endproc
 256              	.LFE4:
 258 0006 C046     		.section	.text.SysTick_Handler,"ax",%progbits
 259              		.align	2
 260              		.weak	SysTick_Handler
 261              		.code	16
 262              		.thumb_func
 264              	SysTick_Handler:
 265              	.LFB5:
 271:../src/cr_startup_lpc11.c **** }
 272:../src/cr_startup_lpc11.c **** 
 273:../src/cr_startup_lpc11.c **** void SysTick_Handler(void)
 274:../src/cr_startup_lpc11.c **** {
 266              		.loc 1 274 0
 267              		.cfi_startproc
 268 0000 80B5     		push	{r7, lr}
 269              	.LCFI11:
 270              		.cfi_def_cfa_offset 8
 271              		.cfi_offset 7, -8
 272              		.cfi_offset 14, -4
 273 0002 00AF     		add	r7, sp, #0
 274              	.LCFI12:
 275              		.cfi_def_cfa_register 7
 276              	.L19:
 275:../src/cr_startup_lpc11.c ****     while(1)
 276:../src/cr_startup_lpc11.c ****     {
 277:../src/cr_startup_lpc11.c ****     }
 277              		.loc 1 277 0 discriminator 1
 278 0004 FEE7     		b	.L19
 279              		.cfi_endproc
 280              	.LFE5:
 282 0006 C046     		.section	.text.IntDefaultHandler,"ax",%progbits
 283              		.align	2
 284              		.global	IntDefaultHandler
 285              		.code	16
 286              		.thumb_func
 288              	IntDefaultHandler:
 289              	.LFB6:
 278:../src/cr_startup_lpc11.c **** }
 279:../src/cr_startup_lpc11.c **** 
 280:../src/cr_startup_lpc11.c **** 
 281:../src/cr_startup_lpc11.c **** 
 282:../src/cr_startup_lpc11.c **** //*****************************************************************************
 283:../src/cr_startup_lpc11.c **** //
 284:../src/cr_startup_lpc11.c **** // This is the code that gets called when the processor receives an unexpected
 285:../src/cr_startup_lpc11.c **** // interrupt.  This simply enters an infinite loop, preserving the system state
 286:../src/cr_startup_lpc11.c **** // for examination by a debugger.
 287:../src/cr_startup_lpc11.c **** //
 288:../src/cr_startup_lpc11.c **** //*****************************************************************************
 289:../src/cr_startup_lpc11.c **** void IntDefaultHandler(void)
 290:../src/cr_startup_lpc11.c **** {
 290              		.loc 1 290 0
 291              		.cfi_startproc
 292 0000 80B5     		push	{r7, lr}
 293              	.LCFI13:
 294              		.cfi_def_cfa_offset 8
 295              		.cfi_offset 7, -8
 296              		.cfi_offset 14, -4
 297 0002 00AF     		add	r7, sp, #0
 298              	.LCFI14:
 299              		.cfi_def_cfa_register 7
 300              	.L21:
 291:../src/cr_startup_lpc11.c ****     //
 292:../src/cr_startup_lpc11.c ****     // Go into an infinite loop.
 293:../src/cr_startup_lpc11.c ****     //
 294:../src/cr_startup_lpc11.c ****     while(1)
 295:../src/cr_startup_lpc11.c ****     {
 296:../src/cr_startup_lpc11.c ****     }
 301              		.loc 1 296 0 discriminator 1
 302 0004 FEE7     		b	.L21
 303              		.cfi_endproc
 304              	.LFE6:
 306              		.weak	ResetISR
 307              		.thumb_set ResetISR,Reset_Handler
 308              		.weak	I2C_IRQHandler
 309              		.thumb_set I2C_IRQHandler,IntDefaultHandler
 310              		.weak	TIMER16_0_IRQHandler
 311              		.thumb_set TIMER16_0_IRQHandler,IntDefaultHandler
 312              		.weak	TIMER16_1_IRQHandler
 313              		.thumb_set TIMER16_1_IRQHandler,IntDefaultHandler
 314              		.weak	TIMER32_0_IRQHandler
 315              		.thumb_set TIMER32_0_IRQHandler,IntDefaultHandler
 316              		.weak	TIMER32_1_IRQHandler
 317              		.thumb_set TIMER32_1_IRQHandler,IntDefaultHandler
 318              		.weak	SSP_IRQHandler
 319              		.thumb_set SSP_IRQHandler,IntDefaultHandler
 320              		.weak	UART_IRQHandler
 321              		.thumb_set UART_IRQHandler,IntDefaultHandler
 322              		.weak	USB_IRQHandler
 323              		.thumb_set USB_IRQHandler,IntDefaultHandler
 324              		.weak	USB_FIQHandler
 325              		.thumb_set USB_FIQHandler,IntDefaultHandler
 326              		.weak	ADC_IRQHandler
 327              		.thumb_set ADC_IRQHandler,IntDefaultHandler
 328              		.weak	WDT_IRQHandler
 329              		.thumb_set WDT_IRQHandler,IntDefaultHandler
 330              		.weak	BOD_IRQHandler
 331              		.thumb_set BOD_IRQHandler,IntDefaultHandler
 332              		.weak	FMC_IRQHandler
 333              		.thumb_set FMC_IRQHandler,IntDefaultHandler
 334              		.weak	PIOINT3_IRQHandler
 335              		.thumb_set PIOINT3_IRQHandler,IntDefaultHandler
 336              		.weak	PIOINT2_IRQHandler
 337              		.thumb_set PIOINT2_IRQHandler,IntDefaultHandler
 338              		.weak	PIOINT1_IRQHandler
 339              		.thumb_set PIOINT1_IRQHandler,IntDefaultHandler
 340              		.weak	PIOINT0_IRQHandler
 341              		.thumb_set PIOINT0_IRQHandler,IntDefaultHandler
 342              		.weak	WAKEUP_IRQHandler
 343              		.thumb_set WAKEUP_IRQHandler,IntDefaultHandler
 344              		.weak	main
 345              		.weak	__main
 346 0006 C046     		.text
 347              	.Letext0:
DEFINED SYMBOLS
                            *ABS*:0000000000000000 cr_startup_lpc11.c
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:22     .isr_vector:0000000000000000 g_pfnVectors
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:19     .isr_vector:0000000000000000 $d
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:77     .text.Reset_Handler:0000000000000000 ResetISR
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:168    .text.NMI_Handler:0000000000000000 NMI_Handler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:192    .text.HardFault_Handler:0000000000000000 HardFault_Handler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:216    .text.SVCall_Handler:0000000000000000 SVCall_Handler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:240    .text.PendSV_Handler:0000000000000000 PendSV_Handler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:264    .text.SysTick_Handler:0000000000000000 SysTick_Handler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 WAKEUP_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 I2C_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 TIMER16_0_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 TIMER16_1_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 TIMER32_0_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 TIMER32_1_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 SSP_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 UART_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 USB_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 USB_FIQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 ADC_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 WDT_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 BOD_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 FMC_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 PIOINT3_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 PIOINT2_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 PIOINT1_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 PIOINT0_IRQHandler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:72     .text.Reset_Handler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:77     .text.Reset_Handler:0000000000000000 Reset_Handler
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:153    .text.Reset_Handler:0000000000000058 $d
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:163    .text.NMI_Handler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:187    .text.HardFault_Handler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:211    .text.SVCall_Handler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:235    .text.PendSV_Handler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:259    .text.SysTick_Handler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:283    .text.IntDefaultHandler:0000000000000000 $t
/var/folders/5m/c5y3dzb93dj37bnmfr76n0fr0000gn/T//ccC6KbhK.s:288    .text.IntDefaultHandler:0000000000000000 IntDefaultHandler
                     .debug_frame:0000000000000010 $d

UNDEFINED SYMBOLS
_vStackTop
__main
main
_etext
_data
_edata
_bss
_ebss
